In [1]:
import pandas as pd
import numpy as np

In [2]:
categorical = pd.read_csv('learningSet_categorical.csv')
numerical = pd.read_csv('learningSet_numerical.csv')
Y = pd.read_csv('learningSet_Y.csv')

In [3]:
df_num = pd.DataFrame(numerical.isna().sum()).reset_index()
df_num.columns = ['column_name','nulls']
df_num[df_num['nulls']>0]

    column_name  nulls
5       WEALTH1  44732
135         MSA    132
136         ADI    132
137         DMA    132
315    NEXTDATE   9973

In [4]:
df_cat = pd.DataFrame(categorical.isna().sum()).reset_index()
df_cat.columns = ['column_name','nulls']
df_cat[df_cat['nulls']>0]

  column_name  nulls
0     OSOURCE    928
5      GENDER   2957
7       SOLIH  89212
8    VETERANS  84986

In [5]:
categorical['GEOCODE2'].value_counts()

A    34484
B    28505
D    16580
C    15524
U      319
Name: GEOCODE2, dtype: int64

In [6]:
numerical['WEALTH1'].value_counts()

9.0    7585
8.0    6793
7.0    6198
6.0    5825
5.0    5280
4.0    4810
3.0    4237
2.0    4085
1.0    3454
0.0    2413
Name: WEALTH1, dtype: int64

In [7]:
numerical['WEALTH1'] = numerical['WEALTH1'].fillna(numerical['WEALTH1'].mode()[0])

In [8]:
numerical['MSA'].value_counts()

0.0       21333
4480.0     4606
1600.0     4059
2160.0     2586
520.0      1685
          ...
9140.0        1
3200.0        1
9280.0        1
743.0         1
8480.0        1
Name: MSA, Length: 298, dtype: int64

In [9]:
numerical['ADI'] = numerical['ADI'].fillna(round(numerical['ADI'].mean()))
numerical['DMA'] = numerical['DMA'].fillna(round(numerical['DMA'].mean()))
numerical['MSA'] = numerical['MSA'].fillna(round(numerical['MSA'].mean()))

In [10]:
numerical = numerical.drop(columns=['NEXTDATE'])

In [11]:
len(numerical.columns)

321

In [12]:
df_num = pd.DataFrame(numerical.isna().sum()).reset_index()
df_num.columns = ['column_name','nulls']
df_num[df_num['nulls']>0]

Empty DataFrame
Columns: [column_name, nulls]
Index: []

In [13]:
df_cat = pd.DataFrame(categorical.isna().sum()).reset_index()
df_cat.columns = ['column_name','nulls']
df_cat[df_cat['nulls']>0]

  column_name  nulls
0     OSOURCE    928
5      GENDER   2957
7       SOLIH  89212
8    VETERANS  84986

In [14]:
drop_list_cats = list(df_cat['column_name'][df_cat['nulls']>0])
drop_list_cats

['OSOURCE', 'GENDER', 'SOLIH', 'VETERANS']

In [15]:
categorical = categorical.drop(columns=drop_list_cats)

In [16]:
df_cat = pd.DataFrame(categorical.isna().sum()).reset_index()
df_cat.columns = ['column_name','nulls']
df_cat[df_cat['nulls']>0]

Empty DataFrame
Columns: [column_name, nulls]
Index: []

In [17]:
categorical.to_csv('learningSet_categorical_clean.csv',index=False)
numerical.to_csv('learningSet_numerical_clean.csv',index=False)